{
  "Glucose Monitoring": [
    "Check pre-meal, bedtime; CGM covers overnight gaps.",
    "Target 70-130 fasting, under 180 post-meal.",
    "Log readings with carbs, insulin, activity notes.",
    "Confirm CGM alarms by finger-stick before treating.",
    "Carry spare strips, batteries and lancets when travelling."
  ],
  "Insulin or Medication Management": [
    "Store unopened insulin 2-8 °C; 28 days at room.",
    "Rotate sites every shot to avoid lipohypertrophy.",
    "Dose meals using your insulin-carb ratio and corrections.",
    "Change pen needle or syringe after each injection.",
    "Plan basal shifts for flights across multiple time zones."
  ],
  "Hypoglycemia": [
    "Treat <70 mg/dL with 15 g carbs; re-check 15 min.",
    "Use glucagon if confusion or seizures occur.",
    "Snack or cut basal after late-day exercise.",
    "Check glucagon expiry monthly; replace promptly.",
    "Teach friends tremor, sweat, irritability warning signs."
  ],
  "Nutrition": [
    "Aim 45-50 % carbs, 30 % fat, 20 % protein.",
    "Spread carbs over 4-5 meals to limit spikes.",
    "Count carbs: Spanish serving ≈ 10 g available carbs.",
    "Reserve sugary drinks strictly for hypo treatment.",
    "Monitor alcohol—late lows common; pair with food."
  ],
  "Exercise": [
    "Consume 10-20 g carbs per exercise hour.",
    "Reduce pre-workout bolus 25-75 % for intensity.",
    "Avoid strenuous sport if >250 mg/dL plus ketones.",
    "Re-check glucose immediately and 2 h post-session.",
    "Keep fast carbs and meter within easy reach."
  ],
  "Mental and Emotional Health": [
    "Screen regularly for anxiety and diabetes distress.",
    "Glucose swings affect mood; share logs with team.",
    "Peer programmes lower HbA1c and stress burden.",
    "Adequate sleep stabilises hormones and morning glucose.",
    "Watch for insulin omission tied to body-image concerns."
  ],
  "Relationship with the Healthcare Team": [
    "Bring device downloads and questions to every visit.",
    "Annual eye, foot and kidney assessments are essential.",
    "Review sick-day insulin adjustments ahead of illnesses.",
    "Discuss closed-loop tech to reduce hypoglycaemia.",
    "Share written action plans with school or work."
  ],
  "General Care": [
    "Inspect feet daily for blisters or colour changes.",
    "Brush and floss—gum disease worsens insulin resistance.",
    "Stay current on flu, tetanus, pneumococcal vaccines.",
    "Clean and dress cuts promptly; watch for redness.",
    "Sleep 8-12 h; deprivation raises glucose and appetite."
  ],
  "Family and Social Support": [
    "Train caregivers in glucagon and carb counting basics.",
    "Teach siblings to recognise hypo and hyper signs.",
    "Regular family meals correlate with better control.",
    "Use task charts to shift responsibility to teens.",
    "Join camps or associations for peer modelling."
  ],
  "Education and Knowledge": [
    "Refresh carb-count skills at least yearly.",
    "Verify online advice with certified educators.",
    "Translate HbA1c to eAG for daily context.",
    "Track time-in-range; aim above 70 %.",
    "Learn basic CPR and first-aid for emergencies."
  ],
  "Work Life and Studies": [
    "Maintain 90-140 mg/dL during exams or critical tasks.",
    "Store insulin cool, away from direct heat.",
    "Align boluses with planned breaks and meals.",
    "Reduce basal for heavy manual labour shifts.",
    "Know legal rights to reasonable diabetes accommodations."
  ],
  "Special Situations": [
    "Pack double supplies for trips; split between bags.",
    "Keep insulin, glucagon in carry-on—cargo may freeze.",
    "Test ketones with illness plus high glucose.",
    "Increase checks at altitude; adrenaline boosts glucose.",
    "Bring fast carbs to competitions despite venue rules."
  ],
  "Caring for Children with Diabetes": [
    "Toddlers need 8-10 glucose checks or CGM alerts daily.",
    "Use 4-5 mm needles with skinfold to avoid muscle.",
    "Teach paediatric-weight glucagon dosing for caregivers.",
    "Create simple words for child-reported hypo symptoms.",
    "Reassess insulin ratios during rapid growth spurts."
  ],
  "Technology and Devices": [
    "Change sensors and infusion sets as manufacturer recommends.",
    "Secure sensors with tape for sweat and swimming.",
    "Upload device data monthly for remote review.",
    "Keep devices within six metres of smartphone receiver.",
    "Carry pen backup; pump failure can trigger DKA."
  ],
  "Autonomy and Aging": [
    "Check vision, dexterity to tailor device choices.",
    "Set phone reminders for doses and glucose checks.",
    "Screen yearly for hypoglycaemia unawareness.",
    "Enable remote alarms for caregiver peace of mind.",
    "Adjust medications with kidney, liver or heart changes."
  ],
  "Self-image and Self-esteem": [
    "Address body-image issues to prevent insulin omission.",
    "Decorate pumps or sensors to boost confidence.",
    "Sports and support groups build diabetes self-efficacy.",
    "Celebrate time-in-range milestones, not only weight.",
    "Prepare courteous facts to dispel diabetes myths."
  ],
  "Economy and Access to Treatment": [
    "Apply for manufacturer or government assistance programmes.",
    "Consider biosimilar insulins to reduce costs.",
    "Stock extra strips and sensors during shortages.",
    "Use community clinics for low-cost HbA1c checks.",
    "Treat hypos cheaply with glucose tablets or soda."
  ],
  "Couple, Sexuality and Fertility": [
    "Aim HbA1c <6.5 % before conception.",
    "Screen erectile issues—possible microvascular complication.",
    "Hormonal contraception may slightly increase insulin need.",
    "Pregnancy glucose target 63-140 mg/dL most of day.",
    "Breastfeeding often lowers post-meal bolus requirements."
  ],
  "Emergencies": [
    "Wear a medical ID stating insulin-treated diabetes.",
    "Keep meter, strips, glucagon, ketone strips in kit.",
    "Practise glucagon injection every six months.",
    "Use rapid insulin, fluids for sick-day ketones.",
    "ER needed for confusion, fruity breath or rapid breathing."
  ],
  "Spirituality and Sense of Life": [
    "Mindfulness can blunt stress-induced glucose spikes.",
    "Seek medical exemptions for prolonged religious fasting.",
    "View self-care as stewardship of health.",
    "Mentor newcomers; shared experience builds resilience.",
    "Set yearly wellbeing goals alongside glycaemic targets."
  ]
}
