{
  "Monitoreo de glucosa": [
    "Un pequeño pinchazo hoy puede evitar una gran complicación mañana.",
    "Cada medición es un paso hacia tu bienestar.",
    "Tus números son mensajes; escúchalos, entiéndelos.",
    "Mide, registra y aprende: tu cuerpo te enseña.",
    "Ten siempre un plan B en tu kit de cuidado."
  ],
  "Manejo de la insulina o medicación": [
    "Tu cuerpo no olvida la insulina, tampoco lo hagas tú.",
    "Cada dosis es una herramienta de vida.",
    "Consulta siempre: la insulina es precisa, no adivina.",
    "Actuar rápido sí, pero con cabeza y cálculo.",
    "Fría, pero no congelada: así se cuida la insulina."
  ],
  "Hipoglucemia": [
    "Conoce tu cuerpo: el temblor y el sudor también hablan.",
    "Una bolsita de azúcar puede salvar el día.",
    "Tu seguridad va primero: prevé antes de salir.",
    "Antes de dormir, una última revisión te cuida toda la noche.",
    "Moverse es salud, pero sin glucosa es un riesgo."
  ],
  "Alimentación": [
    "Comer bien no es privarse, es aprender a elegir.",
    "Tu cuerpo necesita energía regular, no sorpresas.",
    "Come con hambre, no con emociones.",
    "Los carbohidratos no son enemigos, solo necesitan guía.",
    "Light no siempre es sinónimo de sano."
  ],
  "Ejercicio": [
    "Cada paso cuenta: muévete por ti.",
    "Ejercicio con control es una medicina sin receta.",
    "Después de moverte, tus números también se mueven.",
    "Hoy no necesitas correr, solo comenzar.",
    "Antes de correr, escucha a tu glucómetro."
  ],
  "Salud mental y emocional": [
    "No estás solo: vivir con diabetes también cansa.",
    "Negar no cambia la realidad. Aceptar sí la transforma.",
    "Piensa en hoy: lo que haces ahora cuida tu futuro.",
    "Tu camino es tuyo, camínalo con compasión.",
    "Errar no te define: lo que haces después, sí."
  ],
  "Relación con el equipo de salud": [
    "Pregunta, insiste, comprende: es tu salud.",
    "Tú y tu médico sois un equipo, no un tribunal.",
    "Evitar al médico no evita los problemas.",
    "Entender es parte de cuidar.",
    "Construye confianza, no solo consultas."
  ],
  "Cuidados generales": [
    "Una herida sin atención puede convertirse en una batalla.",
    "Tus pies también hablan: míralos cada día.",
    "La boca también es parte del control.",
    "Conocer los riesgos es la mejor forma de evitarlos.",
    "Dormir también es parte del tratamiento."
  ],
  "Apoyo familiar y social": [
    "Querer no es controlar: acompaña, no dirijas.",
    "Educar a los que te rodean alivia tu carga.",
    "Tu diagnóstico no te define ante el mundo.",
    "Hablar es cuidar la mente y el corazón.",
    "Mostrarte como eres también es libertad."
  ],
  "Educación y conocimiento": [
    "Aprender sobre diabetes es empoderarte cada día.",
    "No todo lo que oyes es cierto: infórmate con rigor.",
    "La ciencia avanza, tú también puedes hacerlo.",
    "Una app puede ser tu aliada, no tu enemiga.",
    "Aprender en grupo es crecer acompañado."
  ],
  "Vida laboral y estudios": [
    "Cuidarte no es debilidad, es valentía.",
    "Prepararte en clase también es prevenir.",
    "Tu salud no espera al recreo.",
    "Tu rutina es tu aliada: adapta, no abandones.",
    "Conocer tus derechos te da fuerza para defenderte."
  ],
  "Situaciones especiales": [
    "Tu pasaporte lleva insulina, glucómetro y previsión.",
    "Adapta tus dosis al reloj, no al revés.",
    "Disfrutar también es elegir con inteligencia.",
    "Fe y salud pueden convivir con preparación.",
    "Cuando el cuerpo enferma, la glucosa también se altera."
  ],
  "Cuidado de menores con diabetes": [
    "Convertirlo en rutina lo hace menos temible.",
    "Tu seguridad se multiplica con tu serenidad.",
    "Una llamada y un plan pueden marcar la diferencia.",
    "Enseñar hábitos es sembrar salud futura.",
    "Ser distinto no es debilidad, es fuerza silenciosa."
  ],
  "Tecnología y dispositivos": [
    "La tecnología también necesita vigilancia.",
    "Tu plan B también lleva cinta adhesiva.",
    "Prioriza: cuidar hoy puede ahorrar mañana.",
    "Cada curva en tu gráfico es una historia.",
    "Paciencia digital: lo importante es seguir el control."
  ],
  "Autonomía y envejecimiento": [
    "La diabetes no debe vivirse en soledad: pide ayuda.",
    "Recordatorios, alarmas y rutinas son aliados fieles.",
    "Pedir ayuda no te quita independencia, te da seguridad.",
    "Cuando la memoria falla, los cuidadores brillan.",
    "Pregunta siempre: lo que cambia debe entenderse."
  ],
  "Autoimagen y autoestima": [
    "La diabetes marca una pauta, no un destino.",
    "Ser distinto es tener una historia que contar.",
    "Aceptar es abrazar tu fuerza.",
    "Amar es también compartir lo que se es.",
    "Tu cuerpo cuenta tu lucha, no tu debilidad."
  ],
  "Economía y acceso a tratamiento": [
    "El ahorro nunca debe costar tu salud.",
    "Infórmate sobre tus derechos: existen apoyos.",
    "Pide ayuda: tu salud no debe ser una elección imposible.",
    "Insistir es parte de tu derecho a ser cuidado.",
    "Buscar conocimiento es también un acto de resistencia."
  ],
  "Pareja, sexualidad y fertilidad": [
    "La intimidad también merece cuidado y conversación.",
    "Planificar es poder: sí puedes ser madre/padre con diabetes.",
    "Lo hormonal también influye: ajústalo, no lo ignores.",
    "Escucha tu cuerpo, habla con tu médico.",
    "El amor también se construye con empatía."
  ],
  "Emergencias": [
    "Tu pulsera o tarjeta médica puede hablar por ti.",
    "Practica antes del susto: el glucagón no espera.",
    "Formar a tu familia es parte del tratamiento.",
    "Tener un plan es elegir vivir con seguridad.",
    "Náuseas y confusión no se ignoran."
  ],
  "Espiritualidad y sentido de vida": [
    "No elegiste la diabetes, pero eliges cómo vivirla.",
    "Cada día que eliges cuidarte, eliges seguir.",
    "No sabes lo que vendrá, pero puedes prepararte mejor.",
    "Vivir con diabetes te hace más consciente. Usa esa fuerza.",
    "Hoy también puede tener momentos de luz."
  ]
}